[
  {
    "id": 1,
    "image": "https://images.unsplash.com/photo-1552664730-d307ca884978?auto=format&fit=crop&w=400&q=80",
    "title": "TaskFlow",
    "companyName": "FlowTech Ltd.",
    "description": "TaskFlow is your ultimate productivity companion, designed to help you organize every aspect of your daily life. Create to-do lists, set smart reminders, and categorize your tasks based on priority and deadlines. The clean and minimal interface ensures you stay focused on what truly matters. With cross-device syncing, you can start your day on your laptop and continue seamlessly on your phone. Track your progress with visual charts and analytics to measure your productivity growth. Share tasks with colleagues or friends for collaborative projects. Get gentle notifications instead of overwhelming alerts. Integrate with your calendar to avoid overlapping events. TaskFlow helps you build habits that last, ensuring that every goal is achieved with clarity and confidence.",
    "size": 45,
    "reviews": 1543,
    "ratingAvg": 4.6,
    "downloads": "5M",
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 90 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 703 }
    ]
  },
  {
    "id": 2,
    "image": "https://images.unsplash.com/photo-1599058917212-d750089bc07e?auto=format&fit=crop&w=400&q=80",
    "title": "FitLife",
    "companyName": "Wellness Hub",
    "description": "FitLife is more than a fitness tracker—it’s your personal health coach in your pocket. Whether you want to lose weight, gain muscle, or simply stay active, FitLife provides customized workout routines to suit your lifestyle. The app includes video demonstrations, daily step tracking, and calorie monitoring to ensure balanced progress. Set realistic goals and watch your transformation through weekly summaries and achievements. Sync seamlessly with your smartwatch to monitor heart rate and sleep quality. Get nutritional guidance from certified trainers and dieticians. Join community challenges to stay motivated. Log your meals with an extensive food database. Track hydration, mindfulness, and rest days. FitLife ensures every part of your wellness journey is fun, sustainable, and effective.",
    "size": 60,
    "reviews": 2100,
    "ratingAvg": 4.8,
    "downloads": "1.2M",
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 1180 }
    ]
  },
  {
    "id": 3,
    "image": "https://images.unsplash.com/photo-1511379938547-c1f69419868d?auto=format&fit=crop&w=400&q=80",
    "title": "TuneStream",
    "companyName": "Harmony Labs",
    "description": "TuneStream brings you a world of music, podcasts, and audio stories that adapt to your mood and taste. Enjoy millions of tracks curated into playlists for every occasion—whether you’re working out, relaxing, or studying. The intelligent recommendation engine learns what you love and surprises you with fresh discoveries. Create your own playlists and share them with friends around the world. Stream in high-quality audio or download songs for offline listening. Discover exclusive artist interviews and behind-the-scenes podcasts. Personalize your interface with light or dark themes for any vibe. Follow your favorite musicians to get notified of new releases instantly. Enjoy seamless integration with car and smart home systems. TuneStream isn’t just an app—it’s your personal gateway to endless sound.",
    "size": 85,
    "reviews": 4200,
    "ratingAvg": 4.7,
    "downloads": "6M",
    "ratings": [
      { "name": "1 star", "count": 140 },
      { "name": "2 star", "count": 190 },
      { "name": "3 star", "count": 450 },
      { "name": "4 star", "count": 1300 },
      { "name": "5 star", "count": 2120 }
    ]
  },
  {
    "id": 4,
    "image": "https://images.unsplash.com/photo-1556740714-a8395b3bf30f?auto=format&fit=crop&w=400&q=80",
    "title": "ShopEase",
    "companyName": "EasyBuy Corp.",
    "description": "ShopEase revolutionizes the way you shop online with its intuitive design and smart deal recommendations. Browse millions of products across categories, from electronics to fashion, all in one place. Enjoy personalized discounts based on your preferences and shopping history. Track your orders in real-time and get instant delivery updates. The app’s AI-based price comparison feature ensures you always get the best deal. Secure payment gateways keep your transactions safe. Save your favorite products to wishlists for future purchases. Explore curated gift guides for special occasions. ShopEase also includes a loyalty program that rewards every purchase you make. Experience stress-free shopping with smooth returns, reviews, and 24/7 customer support—all designed to make buying smarter, faster, and easier.",
    "size": 90,
    "reviews": 780,
    "ratingAvg": 4.3,
    "downloads": "8M",
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 250 },
      { "name": "5 star", "count": 290 }
    ]
  },
   {
    "id": 5,
    "image": "https://images.unsplash.com/photo-1503676260728-1c00da094a0b?auto=format&fit=crop&w=400&q=80",
    "title": "EduSpark",
    "companyName": "Learnify",
    "description": "EduSpark is your digital learning hub where knowledge meets creativity. Dive into expertly crafted courses across technology, design, business, and personal development. Learn at your own pace through interactive video lessons, quizzes, and coding challenges. Get hands-on with real-world projects to build your portfolio. Join live sessions with instructors for feedback and guidance. Track your progress and earn digital certificates for completed courses. Collaborate with peers through discussion forums and study groups. Enjoy multilingual support and offline downloads for learning on the go. EduSpark’s AI mentor suggests personalized learning paths based on your goals. Whether you’re a beginner or a professional, EduSpark lights the path to your success in the modern world of learning.",
    "size": 70,
    "reviews": 2300,
    "ratingAvg": 4.9,
    "downloads": "1M",
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 100 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 1740 }
    ]
  },
  {
    "id": 6,
    "image": "https://images.unsplash.com/photo-1553729459-efe14ef6055d?auto=format&fit=crop&w=400&q=80",
    "title": "FinTrack",
    "companyName": "MoneyWise Ltd.",
    "description": "FinTrack is your all-in-one finance manager designed to give you complete control over your money. Easily record your daily expenses and categorize them automatically. Set monthly budgets and track how close you are to your spending goals. Visualize your financial health with detailed charts and trend analyses. Receive smart notifications when bills or subscriptions are due. Securely connect your bank accounts for automated transaction tracking. Export financial reports for tax or business use. FinTrack also helps you plan savings and investments by analyzing spending patterns. Its built-in AI advisor offers suggestions for cutting unnecessary costs. With data encryption and biometric login, your privacy is always protected. FinTrack ensures you spend wisely, save efficiently, and live stress-free financially.",
    "size": 52,
    "reviews": 1560,
    "ratingAvg": 4.4,
    "downloads": "4.6M",
    "ratings": [
      { "name": "1 star", "count": 70 },
      { "name": "2 star", "count": 100 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 640 }
    ]
  },
  {
    "id": 7,
    "image": "https://images.unsplash.com/photo-1509099836639-18ba1795216d?auto=format&fit=crop&w=400&q=80",
    "title": "SnapShot",
    "companyName": "Visionary Labs",
    "description": "SnapShot turns your phone into a professional photography studio. Capture stunning photos with advanced AI filters that adjust lighting, contrast, and tones in real time. Whether it’s portraits, landscapes, or food shots, SnapShot enhances every detail. Experiment with dozens of effects, from vintage film to cinematic styles. Organize your photo gallery with smart tagging and automatic album creation. Share your edits instantly on social media with one tap. Access professional tutorials to improve your photography skills. Use the built-in camera timer and manual controls for precision shots. Cloud backup ensures your memories are never lost. SnapShot gives creativity wings—making every picture a masterpiece waiting to be shared.",
    "size": 95,
    "reviews": 980,
    "ratingAvg": 4.2,
    "downloads": "2M",
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 140 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 280 },
      { "name": "5 star", "count": 260 }
    ]
  },
  {
    "id": 8,
    "image": "https://images.unsplash.com/photo-1526772662000-3f88f10405ff?auto=format&fit=crop&w=400&q=80",
    "title": "TripMate",
    "companyName": "Wanderlust Co.",
    "description": "TripMate makes travel planning effortless and enjoyable. Explore destinations with personalized itineraries based on your budget, interests, and time. Find the best hotels, restaurants, and attractions nearby with verified reviews. Book flights and accommodations securely within the app. Access offline maps and language guides for international trips. The live weather and currency converter keep you prepared anywhere you go. Create group trips and share plans with friends in real time. Receive alerts for flight delays, gate changes, and local events. Save all your travel documents in one digital wallet. TripMate even offers travel tips and safety recommendations for each destination. Wherever you go, TripMate ensures your adventure is smooth, exciting, and memorable.",
    "size": 88,
    "reviews": 1320,
    "ratingAvg": 4.5,
    "downloads": "7M",
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 90 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 420 },
      { "name": "5 star", "count": 610 }
    ]
  },
  {
    "id": 9,
    "image": "https://images.unsplash.com/photo-1501630834273-4b5604d2ee31?auto=format&fit=crop&w=400&q=80",
    "title": "WeatherNow",
    "companyName": "SkyTech",
    "description": "WeatherNow provides the most accurate, real-time weather updates right at your fingertips. Get detailed forecasts for temperature, humidity, wind speed, and air quality. Plan your week with hourly and weekly forecasts customized for your city. The radar map helps you track storms, rain, and clouds visually. Receive instant alerts for severe weather conditions like storms or heatwaves. Switch between light and dark themes to match your mood. Access historical climate data for research or planning events. Integrate with your home widgets for live temperature display. Enjoy smooth animations and minimal ads for a clean experience. With global coverage and precise predictions, WeatherNow is your daily weather companion—smart, reliable, and beautifully designed.",
    "size": 38,
    "reviews": 1670,
    "ratingAvg": 4.6,
    "downloads": "9M",
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 100 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 550 },
      { "name": "5 star", "count": 760 }
    ]
  },
  {
    "id": 10,
    "image": "https://images.unsplash.com/photo-1512820790803-83ca734da794?auto=format&fit=crop&w=400&q=80",
    "title": "Readify",
    "companyName": "SmartRead",
    "description": "Readify brings an entire library to your pocket. Browse thousands of eBooks, audiobooks, and magazines across every genre imaginable. Personalize your reading experience with adjustable fonts, themes, and background colors. Listen to your favorite books on the go with seamless audiobook integration. Highlight and take notes directly within chapters for future reference. Join virtual book clubs to discuss your favorite stories with readers worldwide. Get personalized recommendations based on your reading habits. Sync your progress across all devices effortlessly. Discover exclusive author interviews and early releases. With Readify, learning and entertainment meet in perfect harmony—turning every free moment into a chance to read, listen, and grow.",
    "size": 66,
    "reviews": 2450,
    "ratingAvg": 4.8,
    "downloads": "1.1M",
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 1690 }
    ]
  },
  {
    "id": 11,
    "image": "https://images.unsplash.com/photo-1511512578047-dfb367046420?auto=format&fit=crop&w=400&q=80",
    "title": "Galaxy Run",
    "companyName": "Nova Studios",
    "description": "Galaxy Run takes you on a thrilling adventure through the cosmos. Dash across planets, dodge meteors, and collect power-ups in this endless runner set in space. Each level introduces new obstacles and stunning galactic visuals. Compete with friends on global leaderboards for high scores. Unlock new characters and futuristic spaceships as you progress. Enjoy immersive sound effects and background music that amplify the excitement. Play offline without losing your achievements. Galaxy Run’s smooth controls make gameplay fast, fun, and addictive. Regular updates bring new missions and challenges. Dive into a universe of adrenaline, speed, and discovery where every run is a new adventure.",
    "size": 120,
    "reviews": 9500,
    "ratingAvg": 4.2,
    "downloads": "7M",
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 1600 },
      { "name": "4 star", "count": 2800 },
      { "name": "5 star", "count": 3700 }
    ]
  },
  {
    "id": 12,
    "image": "https://images.unsplash.com/photo-1603791440384-56cd371ee9a7?auto=format&fit=crop&w=400&q=80",
    "title": "PicFix",
    "companyName": "CreativeSoft",
    "description": "PicFix is a powerful AI photo editor made for creators of all levels. With one tap, enhance your images using smart filters and lighting adjustments. Remove unwanted backgrounds instantly or replace them with scenic presets. Explore dozens of artistic styles—from sketch to watercolor effects. Crop, resize, and retouch images with pixel-perfect precision. Use batch editing to process multiple photos at once. Add captions, stickers, or frames to personalize your pictures. PicFix’s AI detects imperfections and corrects them automatically. Save your creations in HD or share directly to Instagram, Pinterest, or Twitter. Whether it’s professional editing or casual fun, PicFix makes every photo stand out effortlessly.",
    "size": 78,
    "reviews": 3350,
    "ratingAvg": 4.6,
    "downloads": "1.5M",
    "ratings": [
      { "name": "1 star", "count": 90 },
      { "name": "2 star", "count": 120 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 900 },
      { "name": "5 star", "count": 1940 }
    ]
  },
  {
    "id": 13,
    "image": "https://images.unsplash.com/photo-1517694712202-14dd9538aa97?auto=format&fit=crop&w=400&q=80",
    "title": "CalmEase",
    "companyName": "MindSpace Ltd.",
    "description": "CalmEase helps you find peace in the chaos of everyday life. Access guided meditations, mindfulness exercises, and deep breathing techniques. Choose sessions tailored for stress relief, focus, or better sleep. The soothing soundscapes and music playlists calm your mind instantly. Track your mental well-being with progress reports and mood journals. Create a daily mindfulness routine that fits your schedule. Sleep stories narrated by calming voices help you unwind before bed. Set reminders to take mindful breaks during your busy day. Join global meditation challenges to stay motivated. With CalmEase, every moment becomes an opportunity to recharge, refocus, and restore your inner balance.",
    "size": 54,
    "reviews": 2400,
    "ratingAvg": 4.9,
    "downloads": "8.5M",
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 1800 }
    ]
  },
  {
    "id": 14,
    "image": "https://images.unsplash.com/photo-1556761175-5973dc0f32e7?auto=format&fit=crop&w=400&q=80",
    "title": "NewsSphere",
    "companyName": "InfoWave Media",
    "description": "NewsSphere keeps you informed with real-time updates from trusted sources around the world. Customize your feed to follow topics you care about—technology, sports, business, or entertainment. Get breaking news alerts as events unfold. Enjoy clean layouts with distraction-free reading mode. Watch short news summaries and live video reports for key stories. Save articles for offline reading later. The AI-powered recommendation engine curates unbiased news tailored to your interests. Join public discussions to share opinions respectfully. Toggle between local and global perspectives effortlessly. NewsSphere ensures that you never miss what matters, keeping you smarter and more connected every day.",
    "size": 42,
    "reviews": 1870,
    "ratingAvg": 4.4,
    "downloads": "8M",
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 130 },
      { "name": "3 star", "count": 260 },
      { "name": "4 star", "count": 580 },
      { "name": "5 star", "count": 800 }
    ]
  },
  {
    "id": 15,
    "image": "https://images.unsplash.com/photo-1573164574572-cb89e39749b4?auto=format&fit=crop&w=400&q=80",
    "title": "ChatLoop",
    "companyName": "Connectify",
    "description": "ChatLoop transforms communication with a modern, secure, and lightning-fast messaging experience. Chat with friends individually or in vibrant group channels. Share photos, videos, documents, and voice notes instantly. Enjoy end-to-end encryption that ensures complete privacy. Customize your chat themes and emojis for every conversation. Use disappearing messages for added security. Switch between dark and light modes for comfort. ChatLoop syncs across devices so you never lose messages. Stay connected with minimal data usage and no lag. Whether for personal or professional use, ChatLoop creates a seamless, engaging, and safe communication loop that keeps you closer to everyone you care about.",
    "size": 90,
    "reviews": 6200,
    "ratingAvg": 4.5,
    "downloads": "3M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 1600 },
      { "name": "5 star", "count": 3100 }
    ]
  },
   {
    "id": 16,
    "image": "https://images.unsplash.com/photo-1534081333815-ae5019106622?auto=format&fit=crop&w=400&q=80",
    "title": "TimeGrid",
    "companyName": "OrganizePro",
    "description": "TimeGrid helps you master time management like never before. Organize meetings, deadlines, and personal events in one smart calendar. Sync with Google, Outlook, and Apple Calendar effortlessly. Use color-coded tags to separate work and personal tasks. Set recurring reminders and never miss an important appointment again. Collaborate with teams by sharing event calendars. TimeGrid’s AI assistant suggests ideal meeting times based on availability. Get daily productivity summaries to stay on track. Enable focus mode to block distractions during key tasks. With its elegant design and powerful features, TimeGrid turns chaos into order—making every minute count toward success.",
    "size": 63,
    "reviews": 1120,
    "ratingAvg": 4.3,
    "downloads": "3.5M",
    "ratings": [
      { "name": "1 star", "count": 70 },
      { "name": "2 star", "count": 90 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 350 },
      { "name": "5 star", "count": 460 }
    ]
  },
  {
    "id": 17,
    "image": "https://images.unsplash.com/photo-1504674900247-0877df9cc836?auto=format&fit=crop&w=400&q=80",
    "title": "MealMaster",
    "companyName": "TastyTech",
    "description": "MealMaster is your ultimate kitchen assistant for healthy living. Explore thousands of recipes crafted by professional chefs and nutritionists. Filter meals by cuisine, dietary preference, or ingredients you already have. Use the smart meal planner to create weekly menus effortlessly. Track calories and nutrients to maintain balanced eating habits. Watch short cooking tutorials for step-by-step guidance. Save favorite recipes and share them with friends. Generate automatic grocery lists for your selected dishes. Adjust serving sizes instantly for families or solo cooking. MealMaster even suggests recipes based on leftovers in your fridge. Enjoy cooking smarter, healthier, and happier—one meal at a time",
    "size": 75,
    "reviews": 2890,
    "ratingAvg": 4.7,
    "downloads": "1M",
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 120 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 700 },
      { "name": "5 star", "count": 1720 }
    ]
  },
  {
    "id": 18,
    "image": "https://images.unsplash.com/photo-1498050108023-c5249f4df085?auto=format&fit=crop&w=400&q=80",
    "title": "SafeLock",
    "companyName": "CyberGuard Inc.",
    "description": "SafeLock is your trusted digital vault for protecting sensitive data. Store passwords, confidential files, and documents securely with military-grade encryption. Access your data only through biometric authentication or a unique PIN. Automatically generate strong passwords for all your accounts. Backup everything to encrypted cloud storage with zero-knowledge protection. Receive alerts if your credentials appear in a data breach. Organize files into secure folders for easy navigation. Enable emergency access for trusted contacts if needed. SafeLock’s offline mode ensures access even without internet. With robust protection and a clean interface, SafeLock guards your digital life with absolute peace of mind.",
    "size": 80,
    "reviews": 940,
    "ratingAvg": 4.2,
    "downloads": "4.2M",
    "ratings": [
      { "name": "1 star", "count": 80 },
      { "name": "2 star", "count": 110 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 240 },
      { "name": "5 star", "count": 310 }
    ]
  },
  {
    "id": 19,
    "image": "https://images.unsplash.com/photo-1522202176988-66273c2fd55f?auto=format&fit=crop&w=400&q=80",
    "title": "LingoBoost",
    "companyName": "EduVerse",
    "description": "LingoBoost makes language learning fun, interactive, and deeply effective. Master speaking, listening, reading, and writing with gamified lessons. Practice real-life conversations using AI chat simulations. Review vocabulary with colorful flashcards and spaced repetition. Earn points and badges as you progress through levels. Watch short cultural videos to understand language in context. Get instant feedback on pronunciation using voice recognition. Track your fluency improvement with daily goals and streaks. Join international learners’ groups to practice live. Offline mode lets you study anytime, anywhere. LingoBoost transforms learning into an adventure—making every word a step closer to global connection.",
    "size": 68,
    "reviews": 3550,
    "ratingAvg": 4.8,
    "downloads": "1.5M",
    "ratings": [
      { "name": "1 star", "count": 70 },
      { "name": "2 star", "count": 90 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 2590 }
    ]
  },
  {
    "id": 20,
    "image": "https://images.unsplash.com/photo-1525609004556-c46c7d6cf023?auto=format&fit=crop&w=400&q=80",
    "title": "RideGo",
    "companyName": "UrbanMove",
    "description": "RideGo changes the way you move around the city. Book rides instantly—cars, bikes, or shared cabs—with real-time GPS tracking. Compare fares across different options before confirming. Enjoy transparent pricing and zero surge surprises. Track your driver’s location and estimated arrival minute by minute. Rate and review rides to help maintain quality service. Access 24/7 in-app support for any issue. Use RideGo Wallet for fast, secure payments. Share your live trip status with family for safety. Earn discounts through loyalty programs and referrals. With clean design, speed, and reliability, RideGo ensures every journey is safe, quick, and hassle-free.",
    "size": 92,
    "reviews": 4100,
    "ratingAvg": 4.4,
    "downloads": "3.8M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 700 },
      { "name": "4 star", "count": 1200 },
      { "name": "5 star", "count": 1500 }
    ]
  },
  {
    "id": 21,
    "image": "https://images.unsplash.com/photo-1526170375885-4d8ecf77b99f?auto=format&fit=crop&w=400&q=80",
    "title": "Aesthetica",
    "companyName": "Pixel Studio",
    "description": "Aesthetica brings art and technology together to enhance every photo. Transform your pictures with AI-driven filters that mimic professional artistry. Apply cinematic tones, double exposures, or vintage film styles in seconds. Adjust brightness, color, and depth with intuitive sliders. Preview before-and-after results to perfect your edits. Explore trending styles from global creators for inspiration. Save your presets for consistent editing themes. Share your work instantly across platforms. Aesthetica supports RAW editing for photographers seeking detail control. With elegance, precision, and creativity combined, Aesthetica redefines visual storytelling for the modern creator.",
    "size": 64,
    "reviews": 2280,
    "ratingAvg": 4.6,
    "downloads": "9.8M",
    "ratings": [
      { "name": "1 star", "count": 90 },
      { "name": "2 star", "count": 100 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 1290 }
    ]
  },
  {
    "id": 22,
    "image": "https://images.unsplash.com/photo-1563013544-824ae1b704d3?auto=format&fit=crop&w=400&q=80",
    "title": "QuickPay",
    "companyName": "FinServe",
    "description": "QuickPay is your ultimate payment companion that makes money transfers effortless. Send and receive funds instantly using just a phone number or QR code. Pay bills, recharge mobiles, and shop online with one tap. Track your spending with categorized transaction history. Set reminders for recurring payments like rent or utilities. Link multiple bank accounts securely with end-to-end encryption. Split bills with friends in seconds during group outings. Earn cashback and rewards for every transaction. Use biometric login for quick access without compromising safety. QuickPay is designed for speed, reliability, and security—making finance feel truly simple.",
    "size": 58,
    "reviews": 2900,
    "ratingAvg": 4.7,
    "downloads": "2.5M",
    "ratings": [
      { "name": "1 star", "count": 80 },
      { "name": "2 star", "count": 120 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 800 },
      { "name": "5 star", "count": 1600 }
    ]
  },
  {
    "id": 23,
    "image": "https://images.unsplash.com/photo-1507525428034-b723cf961d3e?auto=format&fit=crop&w=400&q=80",
    "title": "PathFinder",
    "companyName": "GeoSmart Ltd.",
    "description": "PathFinder helps you navigate the world like a pro. Get accurate turn-by-turn directions with real-time traffic and road conditions. Explore new routes that save time and fuel. Download offline maps for travel in remote areas. Use voice-guided navigation for hands-free convenience. Save favorite locations for quick access later. Discover nearby gas stations, restaurants, and landmarks. Receive alerts about accidents or road closures instantly. Plan multi-stop journeys efficiently for business or vacation trips. PathFinder’s sleek interface and precision mapping make every drive smoother, faster, and stress-free.",
    "size": 110,
    "reviews": 5100,
    "ratingAvg": 4.3,
    "downloads": "5M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 900 },
      { "name": "4 star", "count": 1400 },
      { "name": "5 star", "count": 2100 }
    ]
  },
  {
    "id": 24,
    "image": "https://images.unsplash.com/photo-1603791440384-56cd371ee9a7?auto=format&fit=crop&w=400&q=80",
    "title": "ClipCraft",
    "companyName": "MediaPro",
    "description": "ClipCraft empowers creators to edit videos like professionals. Combine clips, add transitions, and overlay music effortlessly. Trim and merge footage with frame-by-frame accuracy. Apply cinematic filters and motion effects that elevate your visuals. Add text, captions, and animations to tell your story. Use keyframe controls for advanced motion editing. Import soundtracks or record voiceovers directly. Export videos in multiple resolutions, from HD to 4K. Collaborate with friends by sharing editable templates. With ClipCraft’s clean design and AI tools, every creator—from beginner to expert—can craft breathtaking videos that stand out on any platform.",
    "size": 130,
    "reviews": 6700,
    "ratingAvg": 4.5,
    "downloads": "4.2M",
    "ratings": [
      { "name": "1 star", "count": 350 },
      { "name": "2 star", "count": 420 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 1800 },
      { "name": "5 star", "count": 3130 }
    ]
  }
]
